[
    {
        "header": "Church Crush",
        "blogBody": "They say, *the fastest way to get a man to marry you, is to cook his best meal and serve it with a chilled bottle of coke* - okay, nobody said that, i just totally made that up. \n But, if it was true; then Nneka would never get married. \n Nneka, was my church crush - church, in the sense that we attended the same church and she was in the choir - so yeah, church crush! \n But you see, she wasn't like any other choir girl you know. Forget those head-tie wearing, Ankle skirt girls you're probably imagining. Nneka had class, and ass too - not sure which was more, but both were in abundance. Her figure eight (8) shape wasn't helping matters, not to talk of her clear American accent - Mehn! Angels had to be made this way. \n So yeah, we eventually started dating after I broke forcefully out of the deep shackles of friend zone I was submerged in - *middle finger village witches* During the course of our dating, she kept complaining about the money I spent eating out and buying junk food. I never really had a problem with this cos' I barely had time to cook for myself, with my 9 - 8 job and all. - Yeah, 9am to 8pm! My boss was directly related to the devil himself. \n Anyways, she offered to cook and insisted on spending the weekend. She was going to spoil me silly with different kinds of dishes I had never tasted. I knew right then, that I had found the one. No more cornflakes and indomie for one week - goodbye carbohydrates; Hello protein!! \n I fell deeper in love. \n Saturday finally arrived, and I was treated to a huge plate of Egusi soup - Everybody's favourite. \n I'm not much of a Bible story kinda guy, but after first taste, I knew instantly that soup must have been inspired by the story of Lot and the Pillar of Salt. \n My Egusi soup was filled with the missing parts of the Pillar of Salt. I'm not joking, I might have as well, ordered a salt solution instead - heck! it felt like it. \n But I let it slide, maybe she was just nervous cooking for me for the first time - Love, really is blind. \n By evening, we had Beans - or should I even call it that? \n Beans used to be my favourite food, until Nneka catwalked into my life. Now all I see when I think of Beans is horror and battlefields. \n You think I'm lying? Okay, picture David and Goliath. Yep, remember those stones David picked before the fight? - yep! those ones. \n They were present in my dinner plate. Actually, I think I had more stones than Beans for dinner - but then again Love prevailed, I let it slide. \n It was when I saw her washing the rice with soap and sponge the next morning, I knew that I was finished. \n Blood of Donald Trump!!, I shouted! But deep down, I was certain the end was finally here. At that moment, I knew my village witches had won the battle - they were probably twerking to a Gospel beat sef at that time. \n It's been two weeks since that weekend and I've not had the mind to return her calls or texts. Please, how do you arrange your lips to tell somebody you're not doing again? \n Brother zone has never felt more perfect to me. I willingly zone myself. I give up abegi, I'm not doing again joor!   *stolen",
        "imageUrl": "https://1.bp.blogspot.com/-y1KV3LFr2jQ/WBjYFNDUfNI/AAAAAAAAAcw/WXlzl0yM64IMwn6vk6m10hXl6RO6pNn-ACLcB/s320/Screenshot_2016-11-01-18-50-24_1.jpg",
        "category": "Love",
        "createdBy": "619f73b5c29be51e750c71ff"
    },
    {
        "header": "RCCG Youth Pastor Kills Wife",
        "blogBody": "A youth pastor of the Redeemed Christian Church of God (RCCG), Akolade Arowolo, has been sentenced to die by hanging for the murder of his banker wife, Titilayo. \n Pastor Arowolo could not hold back his pains after the court ruling, he burst into a fit of prayer. Titilayo worked with Skye bank, whilst her husband was employed. Prosecutors were able to present compelling evidence that led to the conviction of Mr Arowolo and his sentencing by Justice Lateefat Okunu of the Ikeja High Court, he was handed a death sentence. Justice Okunu held in her over three hours judgment that evidence before the court proved that Arowolo actually murdered his wife in their matrimonial home. \n \n Testimony in the form of a forensic report from Prof. John Oladapo Obafunwa, a pathologist, was what the court used to determine that there was no way the deceased could have stabbed herself to death. Immediately after the judgment, Arowolo fell down in the dock and started shouting “Jesus have mercy.” PM News reports that Prof Obafunwa testified that his autopsy report revealed that Titilayo was killed through 76 knife stab wounds. There were claims by Pastor Arowolo, suggesting that his wife was possessed and inflicted injuries on herself. He noted that the knife wounds affected Titilayo’s left eye, right eye, upper chest area, right chest and collar bone. Prof. Obafunwa pointed out in his testimony that the deceased could not have inflicted such wounds on herself. To further prove its case, prosecution invited some of Titilayo’s family members who testified that Arowolo and Titilayo had always had a troubled marriage. \n \n The family members included Titilayo’s father, George Oyakhire; sister, Ijeh and mother-in-law, Mrs Adetoun Yeside Oyakhire. The three witnesses testified that the couple lived a cat and mouse life. They claimed that the family had at several times, settled serious fights between the couple. None of the witnesses however saw what actually happened on the day Titilayo died. \n The Herald reports that Arowolo’s co-tenant, Adewale Adeyemi also gave evidence in the case. Arowolo’s parents testified that their son was incapable of murder. \n Adeyemi in his evidence said that on the day of the incident he heard a loud noise when he was in his apartment and later saw Arowolo rushing out with a deep cut in his palms. He claimed to have also seen a hammer and a knife with a broken handle in the yard. Other witnesses such a the security man at the Arowolos’ residence, Investigating Police Officer and an MTN Staff also gave evidence in the case. \n \n The Herald reports that Arowolo’s co-tenant, Adewale Adeyemi also gave evidence in the case. Arowolo’s parents testified that their son was incapable of murder \n Adeyemi in his evidence said that on the day of the incident he heard a loud noise when he was in his apartment and later saw Arowolo rushing out with a deep cut in his palms. He claimed to have also seen a hammer and a knife with a broken handle in the yard. Other witnesses such a the security man at the Arowolos’ residence, Investigating Police Officer and an MTN Staff also gave evidence in the case. \n Youth PastorArowolo broke down in tears, after the judge handed him the death sentence, he had claimed he was innocent of killing his wife. Having presented its case, the burden was shifted on Arowolo to defend himself. \n \n Expectedly, Arowolo had his personal explanation as to what happened on the day Titilayo died. First, he claimed that he and his deceased wife had passionate sex for two hours and kissed on the same day she died. \n \n He claimed that Titi stabbed herself to death on the day after they had a fight. Arowolo claimed that Titilayo was possessed by an evil spirit and inflicted several stab wounds on him before turning to herself. Arowolo’s father, Mudashiru and mother also testified of their son’s good behavior, insisting he could not have killed his wife. \n They claimed that he has always been a religious person and was incapable of killing",
        "imageUrl": "https://3.bp.blogspot.com/-JiFgIv4bI9E/WDgvOCp-8zI/AAAAAAAAAe8/SgSjGDTQ_RQDJNjMvsxG2ktIbuFQ7OJzACLcB/s320/Screenshot_2016-11-25-13-24-07_1.jpg",
        "category": "Crime",
        "createdBy": "619f73b5c29be51e750c71ff"
    },

    {
        "header": "Ousmane Dembélé could be risked for Barça’s crucial Champions league match",
        "blogBody": "As Barcelona gear up for a crunch UEFA Champions League Group E clash against SL Benfica, manager Xavi Hernandez could be looking to take a gamble on the fitness of one of his star players in Ousmane Dembele, reports AS. \n \n The Frenchman has made just one appearance so far this term – a small cameo in the Champions League clash against Dynamo Kyiv before picking up another fresh injury that has since sidelined him. \n \n However, heading into Tuesday night’s game at Camp Nou, Xavi is running out of options in the wide areas. This past weekend against Espanyol, the 41-year-old tactician utilised Gavi on the left-wing while deploying Barca B youngsters, Ilias Akhomach and Abdi Ezzalzouli, on the right flank during the first and second halves, respectively. \n \n As Barcelona gear up for a crunch UEFA Champions League Group E clash against SL Benfica, manager Xavi Hernandez could be looking to take a gamble on the fitness of one of his star players in Ousmane Dembele, reports AS. \n \n The Frenchman has made just one appearance so far this term – a small cameo in the Champions League clash against Dynamo Kyiv before picking up another fresh injury that has since sidelined him. \n \n However, heading into Tuesday night’s game at Camp Nou, Xavi is running out of options in the wide areas. This past weekend against Espanyol, the 41-year-old tactician utilised Gavi on the left-wing while deploying Barca B youngsters, Ilias Akhomach and Abdi Ezzalzouli, on the right flank during the first and second halves, respectively. \n \n But both Ilias and Abdi will be unavailable for selection for tonight’s Champions League clash as they are not registered in the official squad. With Ansu Fati and Martin Braithwaite also ruled out, Xavi is thinly stretched as far as options for the right flank go. \n \n Fourth captain Sergi Roberto could have been an option, but he too is sidelined while Sergino Dest, who has been used in the right-wing berth earlier this season, is also an injury doubt. \n \n With Memphis Depay all but certain to line up as the No. 9, all signs point towards Gavi starting on the left flank yet again. As for the right-wing, without Ilias and Abdi, Xavi is left with just one option in the form of fellow youngster Yusuf Demir. \n \n As Barcelona gear up for a crunch UEFA Champions League Group E clash against SL Benfica, manager Xavi Hernandez could be looking to take a gamble on the fitness of one of his star players in Ousmane Dembele, reports AS. \n \n The Frenchman has made just one appearance so far this term – a small cameo in the Champions League clash against Dynamo Kyiv before picking up another fresh injury that has since sidelined him. \n \nHowever, heading into Tuesday night’s game at Camp Nou, Xavi is running out of options in the wide areas. This past weekend against Espanyol, the 41-year-old tactician utilised Gavi on the left-wing while deploying Barca B youngsters, Ilias Akhomach and Abdi Ezzalzouli, on the right flank during the first and second halves, respectively. \n \n But both Ilias and Abdi will be unavailable for selection for tonight’s Champions League clash as they are not registered in the official squad. With Ansu Fati and Martin Braithwaite also ruled out, Xavi is thinly stretched as far as options for the right flank go. \n \n Fourth captain Sergi Roberto could have been an option, but he too is sidelined while Sergino Dest, who has been used in the right-wing berth earlier this season, is also an injury doubt. \n \n With Memphis Depay all but certain to line up as the No. 9, all signs point towards Gavi starting on the left flank yet again. As for the right-wing, without Ilias and Abdi, Xavi is left with just one option in the form of fellow youngster Yusuf Demir. \n \n However, the Austrian is not a traditional winger and is someone who relishes playing on the inside channels rather than hugging the touchlines. With Gavi also not an out-and-out winger, the manager is wary of not having natural width in the attacking unit. And, as a result, he is now considering rushing Dembele back into action for the game, reports AS. \n \n While the Frenchman would not be a part of the starting XI as such, there is a good chance he might be handed minutes off the bench based on how he is feeling during the team’s tactical training session, the report mentions. It also states that Dest, too, could be risked by Xavi with the USMNT star close to recovering fully from his lower-back issues. \n \n While there is an element of risk involved in doing so, particularly with Dembele, given his history with injuries, desperate times call for desperate measures. Grabbing a win on Tuesday would ascertain their place in the knockout phase of the competition, irrespective of the result of their final group game against Bayern Munich.",
        "imageUrl": "https://barcauniversal.com/wp-content/uploads/2021/11/fc-barcelona-v-sd-huesca-la-liga-santander-1536x1024.jpg",
        "category": "Sports",
        "createdBy": "619f73b5c29be51e750c71ff"
    },
    {
        "header": "Opinion: Three probable formations Xavi can use with Barcelona",
        "blogBody": "Under the gentle Catalan sun, the fans cheered, deliriously happy and – to an outsider looking at the state of FC Barcelona –  somewhat inexplicably. The tapestry of garnet and blue was rumbling in anticipation; the excitement and expectation might as well have been as real as the thunder preceding a storm. The cause of their feverish joy stepped onto the Camp Nou field. \n \n The same stadium where he debuted in La Liga against Valencia, went on to beat them an additional 15 times, led one of the best teams ever seen by the footballing world under Pep Guardiola’s tutelage, sang along with the fans countless times as the team lifted trophy after trophy, seemingly unstoppable. This was Xavi Hernandez’s homecoming. \n \n One of the best footballers to play the game, Xavi Hernandez was and is, to the fans, Barcelona personified. The winning spirit, technical excellence, elegance, and intelligence that the Catalan club prides itself on demonstrating is embodied in Xavi. Spain’s conductor and Barcelona’s leader, his career as a player is nothing short of legendary. \n \n Arriving at what has been for a long time now, a dark period for Barcelona, his presence in itself seems to have risen the morale significantly. There are many factors of his appointment, past managerial role, an expected setup that can be discussed in depth. This article deals with a particular sector of the chaos that he faces at Catalonia — the endless probabilities of lineups. \n \n Ahead of Xavi’s managerial debut against Espanyol in a highly-anticipated derby, one of the very defining choices he must make is that of the starting XI. There are several players set to gain, and several who set to lose with this appointment but balancing the players with their respective roles and weighing the importance of experience accurately is a complicated task for Xavi. \n \n From his managerial tenure at Al Sadd, though, we can safely assume that the three formations he is most likely to use are the 3-4-3, the 3-4-1-2, and the traditional 4-3-3. \n \n 1. 3-4-3; an initial argument for undisputed starters \n \n In all three formations, some players can be considered to be undisputable starters. Despite his lacklustre performance over the previous season, Marc-Andre ter Stegen remains the starting goalkeeper. Xavi’s teams look to play out from the back, something he picked up from the very early stages of his career at La Masia. \n \n Ter Stegen doesn’t need to do anything special in terms of this. Playing simple passes to the back three should suffice the vast majority of times. \n \n His long-range distribution has been underwhelming, though. Last season, he completed 100% and 98.7% of his short and mid-range passes, whereas his success rate for passes longer than 30 yards drops down to 73.1%. Despite this, he will start despite the lineup except in exceptional circumstances. \n \n The defence is inarguably Barcelona’s weakest component. In terms of choices, Samuel Umtiti can’t realistically be considered to contest for the starting spot as a result of his injury-prone past and lack of game-time. This factor, however, might change as reports say Xavi has been surprisingly impressed by the Frenchman in training and trusts him greatly. \n \n Ronald Araujo, Barcelona’s most reliable centre-back, is more than capable of playing on the right in the back-three. \n \n Gerard Pique would do best through the middle for two reasons. His experience and reading of the game are invaluable and, if appropriately utilised, could enable him to lead the defence and improve their overall level. \n \n The left side of the trident is competitive, though. Clement Lenglet, Eric Garcia, and maybe even Samuel Umtiti could start here. However, Lenglet remains the safest and most probable choice. \n \n Garcia is already at a disadvantage considering left-footed players will be preferred as left centre-halves. While his overall form has improved, it’s likely that he shifts to second fiddle in this formation. \n \n In midfield, Xavi has an abundance of choices. Veteran and ex-teammate Sergio Busquets is highly unlikely to be dropped from the starting XI. The very uniqueness of his role, his experience, ability, and awareness make him a deserved captain and, to this point, one of Barcelona’s best players. \n \n Granted, there have been times when he has suffered and has underperformed. But when it comes to doing a particular job exceptionally well, there are few, if any, who can match Busi’s level. In a suitable system, Barcelona’s number five is untouchable. \n \n Alongside Busquets, there remains a place for a central midfielder and two wing-backs. In Xavi’s 3-4-3, the wide-midfielders or wing-backs have to cover a massive amount of ground. For these roles, the choice is straightforward. Jordi Alba is uncontested on the left, whereas Dani Alves is likely to edge out Sergino Dest to start. \n \n It would be unrealistic for Alves to play every match for the entire 90 minutes. Instead, a role similar to that of Iniesta in his last season is likely — starting but regularly going off early into the second half or coming in in the middle of the second half.The remaining spot has four realistic competitors — Frenkie De Jong, Pedri, Gavi, and Nico. These four are excellent on the ball, each offering something unique. \n \n Here, things start getting complicated. Among the four, De Jong and Pedri are arguably on a higher level than that of the two La Masia midfielders. It is unlikely that either of them would be dropped, but as a function of his versatility, Pedri can be put aside to be slotted into the front three. \n \n Initially, one might think this would only limit his abilities, but this argument is not convincing for two primary reasons. Firstly, Pedri has played as a winger for a significant portion of his career so far. \n \n Regularly at Las Palmas, and a few times at Barcelona as well. He is not an electric winger who will take the opposition on in a 1v1 regularly. This, counterintuitively, isn’t necessarily a drawback. \n \n This leads us to the second reason. A player’s instructions and role can be altered suitably to get the most out of him and even provide something a different type of player won’t be able to provide. \n \n In this case, Pedri’s role, even as an interior, influenced the final third far more than the middle third unless Barcelona struggled in the build-up. If he were to play as the left forward in the front three of Xavi’s 3-4-3, we could expect him to operate in the channel and at times on the left-wing. \n \n This would only increase his influence and allow him to link up with the central forward and midfield both. Given a certain degree of freedom, his movement could create an excellent link between the midfield, wide-midfielders, and the remaining two attackers. \n \n Now, as two spots remain, we again have to result to considering the positional experience of the best players available. Ousmane Dembele could be a wildcard player here, but his inconsistency and injury prone past means it would make little sense to include him in a probable lineup. Sergio Aguero’s health issues have sidelined him for a while as well. \n \n Ansu Fati and Memphis Depay have the remaining two spots between themselves. Coming back to the positional experience, Ansu has played as a striker and even a false-nine often in his career. \n \n Memphis Depay can operate as a right-winger, though it isn’t his best position. Often, there was fluidity between the front-three in Xavi’s Al Sadd. They would regularly play a very narrow attack, focus on penetrating through the middle and emphasise on tireless runs. \n \n The front three of Pedri, Ansu, and Depay, though not perfect on paper, could excel in doing precisely this. The passing and ball control showed by Pedri, Ansu’s electric, unpredictable dribble, and probability-defying finishing, combined with Memphis’ ability to take players on, make the runs when needed, and create efficiently, just might be what Xavi needs in his front-three. \n \n Pedri · Fati · Memphis \n Alba · Busquets · de Jong · Alves \nLenglet · Pique · Araujo \n ter Stegen \n \n  as a striker and even a false-nine often in his career. \n Memphis Depay can operate as a right-winger, though it isn’t his best position. Often, there was fluidity between the front-three in Xavi’s Al Sadd. They would regularly play a very narrow attack, focus on penetrating through the middle and emphasise on tireless runs .The front three of Pedri, Ansu, and Depay, though not perfect on paper, could excel in doing precisely this. The passing and ball control showed by Pedri, Ansu’s electric, unpredictable dribble, and probability-defying finishing, combined with Memphis’ ability to take players on, make the runs when needed, and create efficiently, just might be what Xavi needs in his front-three. \n \n Pedri · Fati · Memphis \n Alba · Busquets · de Jong · Alves \n Lenglet · Pique · Araujo  \n ter Stegen \n \n 2. 4-3-3; the roots \n The 4-3-3 is a formation that is as likely to be played as the 3-4-3. Though the 3-4-3 was used much more often by Xavi, the 4-3-3 is more suitable to the personnel that he has at his disposal. \n \n For example, in the 3-4-3, the two central midfielders do best when they can cover a lot of ground and maintain control of the ball effectively. While the latter is by no means a problem, the profile of Busquets isn’t ideal for the former. \n \n In a 4-3-3, however, de Jong would be able to make the late runs he excels in and Busquets would be the sole pivot and key to the team’s tempo and possession. \n \n The midfield of Busquets and de Jong would then be joined by Pedri, as it is safe to assume he would be chosen over either Gavi, Nico, and or Riqui Puig. \n \n Coming to the defence, this time it is a back-four. Despite not being in his prime, it wouldn’t be a surprise to see Pique start regularly. Of course, in times of a hectic schedule the starting XI regularly.",
        "imageUrl": "https://barcauniversal.com/wp-content/uploads/2021/11/jpg-2021-11-04T203907-1-1024x683.jpg",
        "category": "Sports",
        "createdBy": "619f73b5c29be51e750c71ff"
    },
    {
        "header": "TB Joshua's widow and the battle for his Nigerian church",
        "blogBody": "Evelyn Joshua has become the head of one of Africa's most influential evangelical churches, but the 52-year-old is faced with the challenge of maintaining her late husband's legacy. TB Joshua's unexpected death in June at the age of 57 unleashed a succession battle that took months to resolve. \n \n But the giant gates at his Synagogue Church of All Nations (SCOAN) in Nigeria's biggest city have swung open again to welcome worshippers for the first time in five months. He was famous for his prophecies and teachings, attracting tens of thousands from across the world to Lagos, including top politicians from Africa and Latin America. \n \n Succession is rarely discussed at Nigerian Pentecostal churches and often passes on uncontested to the spouse of the deceased founder.But at SCOAN, Mrs Joshua, who is an ordained pastor, faced competition as she was not a member of the church's board of trustees. This was taken by her opponents as an indication that her husband did not consider her his successor. \n \n The prophet and his 'wise men \n \n Unlike other wives of Nigeria's mega pastors, she mostly stayed in the background during their three-decade marriage. TB Joshua, known by SCOAN members as 'the prophet', worked with a group of close disciples he called the 'wise men' - one of whom it was believed was being groomed to succeed him. \n \n But after his death, those loyal to Mrs Joshua obtained a court order making her a member of the board and so smoothing the path for her to assume control. The church has since announced Mrs Joshua as the new leader 'under the guidance of God', enraging some factions of the church unhappy about the lack of transparency. In particular the group known as Global Congress of SCOAN Members (GCSM), purportedly backed by some senior members, has questioned the choice. But she has left no-one in doubt as to who is in charge, leading the first SCOAN service on 7 November since her husband's death. \n \n She reportedly lost no time in stamping her authority on the church, using the last few months to carry out some house-cleaning. Videos have emerged of some members, mostly foreigners, who had lived in the vast compound for years, vacating amid jeers. One member euphemistically described it as 'an audit'. Those removed from the premises were said to be opposed to Mrs Joshua's leadership. \n \n After the demise of the prophet some of his disciples did not approach Evelyn with respect and maturity, Patrick Iwelunmor, a former media aide to the Joshuas, told the BBC. There have also been allegations of fraud and Nigeria's anti-corruption agency, the EFCC, confirmed to the BBC that it was investigating a case of theft at the church. Leading members of TB Joshua's inner circle were accused of fleeing with bags of cash after his death. \n \n Evelyn Joshua has become the head of one of Africa's most influential evangelical churches, but the 52-year-old is faced with the challenge of maintaining her late husband's legacy. TB Joshua's unexpected death in June at the age of 57 unleashed a succession battle that took months to resolve. But the giant gates at his Synagogue Church of All Nations (SCOAN) in Nigeria's biggest city have swung open again to welcome worshippers for the first time in five months. He was famous for his prophecies and teachings, attracting tens of thousands from across the world to Lagos, including top politicians from Africa and Latin America. \n \n  Members of Synagogue Church of All Nations (SCOAN) hold a candlelight procession for TB Joshua in Lagos, Nigeria - Monday 5 July 2021 There was a huge outpouring of grief when TB Joshua unexpectedly died in June. Succession is rarely discussed at Nigerian Pentecostal churches and often passes on uncontested to the spouse of the deceased founder. But at SCOAN, Mrs Joshua, who is an ordained pastor, faced competition as she was not a member of the church's board of trustees. This was taken by her opponents as an indication that her husband did not consider her his successor. The prophet and his 'wise men' \n \n Unlike other wives of Nigeria's mega pastors, she mostly stayed in the background during their three-decade marriage. TB Joshua, known by SCOAN members as 'the prophet', worked with a group of close disciples he called the 'wise men' - one of whom it was believed was being groomed to succeed him. More than six million people follow the TB Joshua Ministries Facebook page - a figure that has grown since his death. But after his death, those loyal to Mrs Joshua obtained a court order making her a member of the board and so smoothing the path for her to assume control. \n \n The church has since announced Mrs Joshua as the new leader 'under the guidance of God', enraging some factions of the church unhappy about the lack of transparency. In particular the group known as Global Congress of SCOAN Members (GCSM), purportedly backed by some senior members, has questioned the choice. But she has left no-one in doubt as to who is in charge, leading the first SCOAN service on 7 November since her husband's death. She reportedly lost no time in stamping her authority on the church, using the last few months to carry out some house-cleaning. Videos have emerged of some members, mostly foreigners, who had lived in the vast compound for years, vacating amid jeers. One member euphemistically described it as 'an audit'. Those removed from the premises were said to be opposed to Mrs Joshua's leadership. 'After the demise of the prophet some of his disciples did not approach Evelyn with respect and maturity', Patrick Iwelunmor, a former media aide to the Joshuas, told the BBC. \n \n There have also been allegations of fraud and Nigeria's anti-corruption agency, the EFCC, confirmed to the BBC that it was investigating a case of theft at the church. Leading members of TB Joshua's inner circle were accused of fleeing with bags of cash after his death. \n \n It is unclear if this is what is under investigation, though Nigeran newspaper The Punch has reported that this was why some members of the church have gone into hiding. Proposal after first date Yet Mrs Joshua's biggest hurdle will be proving her spiritual credentials to the thousands of followers who adored her husband. They came for his charisma and wisdom and will expect nothing less from the new leader. \n \n Residents and church members gather at the main gate of The Synagogue Church of All Nations headquarters to mourn the death of TB Joshua in Lagos, Nigeria - 6 June 2021 SCOAN's headquarters in Lagos are vast Gbenga Osinaike, editor-in-chief of the Church Times Nigeria, admits her appointment came as surprise. \n \n 'She was preaching every now and again but TB Joshua never deferred to her', he told the BBC. They spent 45 minutes together on that first meeting, by the end of which he had asked for her hand in marriage.",
        "imageUrl": "https://s.yimg.com/ny/api/res/1.2/CmNW4cJH_xS8FwPXaVJvmw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTcwNTtoPTM5Nw--/https://s.yimg.com/uu/api/res/1.2/mXVpk5GL0xEKdp9lTYQGgw--~B/aD01NDk7dz05NzY7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bbc_us_articles_995/e6853f07553e3be903cce3ac0d8d4984",
        "category": "Religion",
        "createdBy": "619f73b5c29be51e750c71ff"
    },
    {
        "header": "Davido Plans to Donate $600,000 to Nigerian Orphanages",
        "blogBody": "Nigerian-American musician Davido is celebrating his birthday by doing good deeds and giving back. The IF singer tweeted, If u know I’ve given you a hit song .. send me money …. una know una selves oo on Wednesday. The follow-up tweet was his bank information so that people could actually sent him money. Ten minutes later he updated his followers saying that he reached 7 million and that he wanted to reach 100 million to clear [his] rolls Royce from port abeg, meaning from a port. \n \n Every few minutes he continued to update his fans revealing how much he was increasing. 22, 43, 55 he wrote each number in three separate tweets sharing what amount in millions he’s reached. After sharing several screenshots of his account, he shared another one on Nov. 18 which said he 184,104,565.73 in Nigerian naira, which is the currency in Nigeria. \n  Omo 7 m in 10 minutes keep goin!! I love y'all! \n AIM NAH 100m I wan clear my rolls Royce from port abeg \n \n On Nov. 20 he gave a statement on Instagram sharing his *gratitude* to those that took part in the donation. He wrote, I have always been passionate about giving back and helping people. In view of this, I am delighted to announce that all the funds received, totaling 200,000,000.00 naira will be donated to orphanages across Nigeria as well as the Paroche foundation. \n \n Davido also said that he is adding 50,000,000 naira to the amount and listed the five “beneficiaries” that will oversee the distribution of the money. The 250,000,000 in naira is about 600,000 in U.S. dollars. To confirm his sincerity about the project he said explained the exact steps the beneficiaries plan to do to make sure the money ends up in where it should. He said, “The committee will compile a list of orphanage across Nigeria. They will determine the number of children and their needs at each orphanage, and then divide the funds accordingly. The committee will also determine the portion of the money that will be donated to Paroche foundation. To maintain transparency, the committee will make public the names of the beneficiary orphanages and how much each will receive. The 29-year-old said this will now be a new tradition for him every year when he celebrates his birthdays in the future.",
        "imageUrl": "https://s.yimg.com/ny/api/res/1.2/61h9n6M3iBzhKMsR3Nqv6w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTcwNTtoPTU1OA--/https://s.yimg.com/uu/api/res/1.2/VsgV7iC3As2m9QBxonHDvA--~B/aD00NzU7dz02MDA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/atlanta_black_star_articles_803/a5fd8163d7f91c7ead19d05abb95e779",
        "category": "Music",
        "createdBy": "619f73b5c29be51e750c71ff"
    },
    {
        "header": "American Music Awards 2021: The complete winners list",
        "blogBody": "The 2021 American Music Awards, hosted by Cardi B, had some of the biggest names in music perform at the Microsoft Theatre in Los Angeles Sunday night. \n Silk Sonic -- made up of Bruno Mars and Anderson. \n Paak -- opened up the show draped in matching red velvet suits as they serenaded the crowd with their hit 'Smoking Out the Window'.\n The K-pop sensation BTS also took the stage with Coldplay and got the crowd rocking with their collaboration My Universe. Afterwards, the group -- to no surprise -- took home multiple AMAs including artist of the year, best pop duo or group and favorite pop song for 'Butter,' which they performed to close out the show. Olivia Rodrigo, who held the most nominations of the night, delivered a tender performance of her ballad 'Traitor' barefoot and with her guitar in tow. She went home with the AMA for new artist of the year. \n \n When it came to favorite pop album, though, Taylor Swift, who was not in attendance, snagged the honor and accepted via video message. Italian band, Måneskin, made its debut performance with the trending hit 'Beggin,' leaving the crowd begging for more. Likewise, Givēon took the stage for the first time and performed his popular song, 'Heartbreak Anniversary.' On the other hand, Jennifer Lopez isn't new to the AMA stage but she did perform her new song, 'On My Way,' from her upcoming movie 'Marry Me.' \n \n As a special treat, the AMAs briefly took a trip back to '80s, with the Battle of Boston -- a back-and-forth between natives New Kids On The Block and New Edition. Both groups took turns performing some of their biggest records, before it was revealed that they're going on tour separately. \n \n Here's the complete list of winners from this year's ceremony: \n \n ARTIST OF THE YEARBTS \n NEW ARTIST OF THE YEAROlivia Rodrigo \n COLLABORATION OF THE YEARDoja Cat ft. SZA, 'Kiss Me More' \n FAVORITE TRENDING SONGMegan Thee Stallion, 'Body' \n FAVORITE MUSIC VIDEOLil Nas X, 'MONTERO (Call Me By Your Name)' \n FAVORITE MALE POP ARTISTEd Sheeran \n FAVORITE FEMALE POP ARTISTTaylor Swift \n FAVORITE POP DUO OR GROUPBTS \n FAVORITE POP ALBUMTaylor Swift, 'evermore' \n FAVORITE POP SONGBTS, 'Butter' \n FAVORITE MALE COUNTRY ARTISTLuke Bryan \n FAVORITE FEMALE COUNTRY ARTISTCarrie Underwood \n FAVORITE COUNTRY DUO OR GROUPDan + Shay \n FAVORITE COUNTRY ALBUMGabby Barrett, 'Goldmine' \n FAVORITE COUNTRY SONGGabby Barrett, 'The Good Ones' \n FAVORITE MALE HIP-HOP ARTISTDrake \n FAVORITE FEMALE HIP-HOP ARTISTMegan Thee Stallion \n FAVORITE HIP-HOP ALBUMMegan Thee Stallion, 'Good News' \n FAVORITE HIP-HOP SONGCardi B, 'Up' \n FAVORITE MALE R&B ARTISTThe Weeknd \n FAVORITE FEMALE R&B ARTISTDoja Cat \n FAVORITE R&B ALBUMDoja Cat, 'Planet Her' \n FAVORITE R&B SONGSilk Sonic (Bruno Mars, Anderson .Paak), 'Leave The Door Open' \n FAVORITE MALE LATIN ARTISTBad Bunny \n FAVORITE FEMALE LATIN ARTISTBecky G \n FAVORITE LATIN DUO OR GROUPBanda MS de Sergio Lizárraga \n FAVORITE LATIN ALBUMBad Bunny, EL ÚLTIMO TOUR DEL MUNDO \n FAVORITE LATIN SONGKali Uchis, 'telepatía' \n FAVORITE ROCK ARTISTMachine Gun Kelly \n FAVORITE INSPIRATIONAL ARTISTCarrie Underwood \n FAVORITE GOSPEL ARTISTKanye West \n FAVORITE DANCE/ELECTRONIC ARTISTMarshmello",
        "category": "Movies",
        "imageUrl": "https://s.abcnews.com/images/GMA/rodrigo-gty-rc-211121_1637592876050_hpEmbed_13x9_992.jpg",
        "createdBy": "619f73b5c29be51e750c71ff"
    },
    {
        "header": "Music programs for seniors",
        "blogBody": "CHARLOTTE, N.C. — Tosco Music is a nonprofit organization that has been building community through music for over 20 years with variety music concerts called Tosco Music Parties. Tosco Music also provides youth music scholarships, and brings other live music performances to seniors, presenting local acts performing a wide variety of music genres. \n Their programs for older adults happen at community centers, churches, and independent and long-term-care residences across the Charlotte region. 40-50 this year at more than a dozen locations. \n We pivoted to virtual programming and outdoor performances when the pandemic hit. \n \n Shared music contributes to an experience of belonging, connectedness and community as an antidote to the social isolation that so many seniors experience. With senior singalong parties, local professional musicians perform songs from the 1940’s, 50’s and 60’s that keep music and memory alive for seniors. The singalong format builds connections by engaging seniors with the music from their generation, and with each other in their own residential communities. \n \n Tosco Music wants to be able to increase the number of music programs for older adults across Charlotte, and increase the number of professional musicians engaged with providing this service for Charlotte’s older population. To help, visit www.ToscoMusic.org to make a donation.",
        "category": "Life",
        "imageUrl": "https://s.yimg.com/ny/api/res/1.2/jrmmyWIe4MOBKE_DqtxlwA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTcwNTtoPTM5NztjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/N3QEhcHE2cDHVoYZdUsjvQ--~B/aD03MjA7dz0xMjgwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/axios_articles_623/eeb7af65fc2fb1ab650445afafd0cfaf",
        "createdBy": "619f73b5c29be51e750c71ff"
    },
    {
        "header": "Trump-backed Sean Parnell ends Senate campaign",
        "blogBody": "Republican Sean Parnell, the Trump-backed candidate running to represent Pennsylvania in the Senate, announced Monday that he is dropping out of the race after losing custody of his children to his estranged wife. \n Why it matters: Parnell was considered one of the frontrunners for the GOP nomination to replace Sen. Pat Toomey (R-Pa.), who is retiring at the end of his term after Trump endorsed the former U.S. Army Ranger in September. \n \n Details: Laurie Snell has accused Parnell of multiple forms of abuse, including choking her and hitting one of their children, the Washington Post reports. The couple separated in 2018. \n Parnell denies the allegations, but Senior Judge James Arner wrote in his order that he believes 'Parnell did commit some acts of abuse in the past,\n \n per the Post as Arner found Snell to be “the more credible witness” in proceedings. \n \n After hearing testimonies from both parents as well as the three children, Arner awarded primary physical and sole legal custody of their children to Snell. \n  \n Arner also factored in Parnell's run for office, which would require frequent travel away from the children, according to the Post. What he's saying: 'I strongly disagree with the ruling today,'' \n \n Parnell said in a statement. \n \n 'There is nothing more important to me than my children, and while I plan to ask the court to reconsider, I can’t continue with a Senate campaign. My focus right now is 100% on my children, and I want them to know I do not have any other priorities and will never stop fighting for them.'",
        "imageUrl": "https://s.yimg.com/ny/api/res/1.2/jrmmyWIe4MOBKE_DqtxlwA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTcwNTtoPTM5NztjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/N3QEhcHE2cDHVoYZdUsjvQ--~B/aD03MjA7dz0xMjgwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/axios_articles_623/eeb7af65fc2fb1ab650445afafd0cfaf",
        "category": "Politics",
        "createdBy": "619f73b5c29be51e750c71ff"
    }
]
